<?php
/**
 * Created by PhpStorm.
 * User: nursultan
 * Date: 7/22/17
 * Time: 9:08 PM
 */

namespace AppBundle\DataFixtures\ORM;


use AppBundle\Entity\Song;
use Doctrine\Common\DataFixtures\AbstractFixture;
use Doctrine\Common\DataFixtures\FixtureInterface;
use Doctrine\Common\DataFixtures\OrderedFixtureInterface;
use Doctrine\Common\Persistence\ObjectManager;

class LoadSongData extends AbstractFixture implements FixtureInterface, OrderedFixtureInterface
{
	/**
	 * Load data fixtures with the passed EntityManager
	 *
	 * @param ObjectManager $manager
	 */
	public function load(ObjectManager $manager)
	{


		foreach ($this->getSongs() as $s) {
			$song = new Song();
			$song->setTitle($s['title'])
				 ->setDuration($s['duration'])
				 ->setCountPlay($s['count_play'])
				 ->setLikes($s['likes'])
				 ->setLyrics($s['lyrics'])
				 ->setDownloadable($s['downloadable'])
				 ->setCountDownload($s['count_download'])
				 ->setPublished($s['published'])
				 ->setPublishedAt($s['published_at'])
				 ->setUuid($s['uuid']);

			$this->addReference($s['uuid'], $song);
		}
	}

	/**
	 * Get the order of this fixture
	 *
	 * @return integer
	 */
	public function getOrder()
	{
		return 0;
	}

	private function getSongs()
	{
		return $songs = [
			[
				'title'          => 'Бололу бирге',
				'duration'       => '04:18',
				'count_play'     => 1220,
				'likes'          => 123,
				'lyrics'         =>
					'Сөзү : Ерболат Каракойшы
Обону : Мерхалил Махмудов
Ай сулуу кыз аткан таңдай,
Көңүл учту сага карай,
Карайм карегимди албай...
Тилегиңиз жанга дос бекен?
Жүрөгүңүз али бош бекен?
Кечиктимби мен ай, билемин кандай?

Баатыр жигит болчу Абай,
Сендейлерди көргөм далай.
Анча, ашыкпаңыз андай...
Жүрөк ээси болуу урмат го,
Аны ачуу сизге кымбат го,
Ачкычын да албай,
Ачасыз кандай?

Кайырма:
Ачып алам, оңой жолу керек,
Ашык адам тапкыч болуу керек.
Максаттарын бийик коюу керек,
Эки жүрөк бирдей согуу керек.
Көзүңүздү жатка ыйгарбай,
Өзүңүздү бекер кыйнабай.
Бөлүнбөй, биз күндө, бололу бирге!

Кабагыңа конгон Күн-Ай,
Карегиңе толгон чырай,
Сени шүгүр берген Кудай.
Сезимиңди арнап келсең ай,
Эркелеген менин эркем ай.
Бакытты далай, көрөлү ары карай.

Эркелетип эчен курдай,
Кылыгыма жүрсөң чыдай,
Бактылуу боломун тынбай.
Сен болосуң менин шерим ай,
Мен болоюн сенин теңиң ай,
Сүйүүмдү арнай, жүрөйүн талбай.

Кайырма:
Ары жагы биздин багыбыздан,
Арылалы жалгыз жагыбыздан.
Сагыналы ойлоп таңыбыздан,
Табылалы дайым жаныбыздан.
Көзүбүздү жатка ыйгарбай,
Өзүбүздү бекер кыйнабай,
Бөлүнбөй, биз күндө, бололу бирге!',
				'downloadable'   => true,
				'count_download' => 3,
				'published'      => true,
				'published_at'   => new \DateTime('01-02-2016'),
				'uuid'           => 'ead5ab32-11c1-4771-8fdc-8764a4109adc'
			],
			[
				'title'          => 'Апакемдин маанайы',
				'duration'       => '03:25',
				'count_play'     => 22000,
				'likes'          => 1223,
				'lyrics'         =>
					'Сөзү : Нурлан Насиптики
Обону : Нурлан Насиптики
Алыс кетсем үйүмдөн, кабатырланып,
Күнү-түнү уктабай санаага батып.
Кара чачың агартып, бизди чоңойттуң,
Рахматымды айтсам да, таманыңда н өпсөм да.
Аздык кылат апакем.

Кайырма:
Апакемдин маанайы,
Ачык болсун ар дайым.
Оорубачы апакем,
Узун өмүр каалаймын.

Төрүбүздүн көркүсүң, бейиш үйүбүз,
Сизден алып тарбия, тунук дилибиз.
Балдарыңды чоңойттуң, урмат-сыйын көр,
Небере да жетелеп, алар сага эркелеп,
Узак өмүр сүрүңүз.

Кайырма:',
				'downloadable'   => true,
				'count_download' => 300,
				'published'      => true,
				'published_at'   => new \DateTime('01-02-2017'),
				'uuid'           => 'e849bcb0-c9de-493e-b65f-f6f9f4cd7539'
			],
			[
				'title'          => 'Таттуу махабатым',
				'duration'       => '03:16',
				'count_play'     => 22000,
				'likes'          => 1223,
				'lyrics'         =>
					'Сөзү : Кудрет Тайчабаровдуку
Обону : Нурлан Насиптики
Билбейм неге ээлеп алдың ойлорумду,
Түшкө кирдиң, сен да мени ойлодуңбү?
Үмүтүм өчүп-жанып турган кезде,
Бир жылмайып койбодуңбу?

Кайырма:

Таттуу махабатым, сага ыр сунамын,
Мени жандап турсаң ар дайым
Бакытка кабыламын.
Таттуу махабатым, сени издеп таптым,
Ширин сүйлөп турсаң ар дайым
Сезимге багынайын.

Көздөрүңө байланамын эркем менин,
Сезип турам келет сенин эркелегиң.
Жашоодо кол кармашып бирге болсок,
Жаркын болот келечегим.

Кайырма:',
				'downloadable'   => true,
				'count_download' => 300,
				'published'      => true,
				'published_at'   => new \DateTime('01-02-2014'),
				'uuid'           => 'c461ebe3-eaf5-461f-aa16-d768728dc18d'
			],
			[
				'title'          => 'Көпөлөгүм',
				'duration'       => '03:36',
				'count_play'     => 22000,
				'likes'          => 1223,
				'lyrics'         =>
					'Сөзү : Нурлан Насиптики
Обону : Нурлан Насиптики

Жалгызым менин, жашоомдо сенсиң,
Кылыктарың чыгат эркелесең сенин.
Жаратканымдын энчилеп мага,
Буюруп койгон белеги сенсиң.

Сен, мен түбөлүк дайым,
Кол кармашып жүрөлүк, жаным.
Махабатка чөмүлүп бирге,
Таталы сүйүүнүн даамын.

Кайырма:
Мен, мен сени сүйөмүн,
Татынакайым, таарынчагымсың, балапаным.
Мен, мен сени сүйөмүн,
Жан дүйнөмдөн көкөлөп учкан, көпөлөгүм.

Тамаша айтсам таарынып мага,
Капа болот менин тентегим.
Түбөлүк мага колуңду сунуп,
Өмүрүмдүн гүлү болчу сен.

Гүлдөрдүн түрүн үзөйүн тандап,
Жүрөктөн сунам сүйүүмдү арнап,
Бир келген бакытты учурбай, жаным,
Жүрөлү жанашып сүйүүнү барктап.

Кайырма:',
				'downloadable'   => true,
				'count_download' => 300,
				'published'      => true,
				'published_at'   => new \DateTime('01-02-2017'),
				'uuid'           => '24aa3472-1fed-4aed-ac25-f6fe38378a16'
			],
			[
					'title'          => 'Биз экөөбүз',
					'duration'       => '03:43',
					'count_play'     => 22000,
					'likes'          => 1223,
					'lyrics'         =>
							'Сөзү : О.Султановдуку
Обону : Р.Абдыкадыровдуку
Билбейм кайдан жаралгансың сен мага?
Маңдайыма бүткөн жалгыз бакыттай.
Сени сүйдүм, буйрук алып тагдырдан,
Башкалардын миңи сага татыбай!

Же болбосо сен жаралып мен үчүн,
Төрөлгөндө мендик болуп төрөлдүң.
А болбосо, айтчы, жаным, эмне үчүн,
Зарлап тапкан перзентимдей көрүндүң?

Биз жолуктук майдын жумшак түнүндө,
Ал түн мага сени эскерткич белектей.
Мен сүйлөсөм сенин үнүң үнүмдөй,
Мен көрүүгө сенин көзүң керектей.

Уктаганда сенин уйкуң менде бар,
Ойлорум да ойлоруңа киришкен.
Сен экөөбүз эки сандай барабар,
Сен экөөбүз эки суудай бириккен.

Биз экөөбүз эки сандай барабар,
Биз экөөбүз эки суудай бириккен.',
					'downloadable'   => true,
					'count_download' => 300,
					'published'      => true,
					'published_at'   => new \DateTime('01-02-2017'),
					'uuid'           => 'e0dc01f8-cfdd-4ba3-bab7-8d8f6511e0a5'
			],
			[
					'title'          => 'Классташым',
					'duration'       => '03:58',
					'count_play'     => 2200,
					'likes'          => 12,
					'lyrics'         =>
							'Сөзү : Назира Алимжанованыкы
Обону : Назира Алимжанованыкы
Балалыгымда шок кыз элем,
Апамдын сөзүн укпайт элем.
Балдарды, кыздарды коркутуп,
Классыбыздын көзүрү элем.
Ойноп-күлүп ал күндөр өттү,
Дарактар саргайып күз өттү.
Ошондогу эң биринчи кат,
Жүрөгүмдө сүйүү ойготту.

Кайырма:
Классташым, классташым,
Кайдасың, менин классташым?
Жандашым, жандашым,
Классташым, классташым,
Кайдасың, менин классташым?

Класстын эшиги чоң ачылып,
Кирип келди жаңы классташым.
Кар жылтырап кирпиктеринен,
Эсимде калды көз карашың.
Жылдар өттү, өттү балалык,
Сүйүүбүздү сактай албадык.
Бирок жааганда биринчи кар,
Классташымдан мен күтөм кабар.

Кайырма:',
					'downloadable'   => true,
					'count_download' => 100,
					'published'      => true,
					'published_at'   => new \DateTime('01-02-2017'),
					'uuid'           => '1bf85ee0-1510-40ff-b7d9-86bbf0318ff4'
			],
			[
					'title'          => 'Асылкечим',
					'duration'       => '03:33',
					'count_play'     => 2200,
					'likes'          => 12,
					'lyrics'         =>
							'Сөзү : Р.Шакированыкы
Обону : М.Токтосуновдуку
Асылкечим сен жөнүндө жазам дастан,
Сүйүүнүн тушоосунан чыга албастан.
Өмүр да өтүп кетет максат менен,
Уккан сөз, ушак сөзгө айланбастан.

Асылкечим, асылкечим, асылкечим,
Кайрып берчи махабатымды.

Сүйүү кулу, акын Мидин айткандай,
Жетпесем да, жеңиши жок убарам.
Жүрөт белем карааныңа жалынып,
Менде болсо жүрөктөгү бурамаң.

Асылкечим, асылкечим, асылкечим,
Кайрып берчи махабатымды.

А, мен болсо кала бердим ошол бойдон,
Сени деп каректерим көз жаш болгон.
Аягында үмүт менен күтөм сени,
Арманым ай, ак жүрөгүм муңга толгон.

Асылкечим, асылкечим, асылкечим,
Кайрып берчи махабатымды.',
					'downloadable'   => true,
					'count_download' => 100,
					'published'      => true,
					'published_at'   => new \DateTime('01-02-2017'),
					'uuid'           => 'd214ec6b-e5ae-43f1-a56d-6686cd5ac0a3'
			]
		];
	}
}